БухЭксп/Reports/CW_АнализБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_АнализБюджета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПараметрКоманды</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВерсииБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыБюджетовПоЗаявкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантГруппировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/Reports/CW_АнализБюджета/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ПараметрКоманды = Новый ХранилищеЗначения(Параметры.ПараметрКоманды);
	Параметры.Свойство("ВариантГруппировки", Отчет.ВариантГруппировки); 
	
	Элементы.ВерсияБюджета.Видимость = (Отчет.ВариантГруппировки <> "ЗАЯВКА");
	
	Если Отчет.ВариантГруппировки <> "ЗАЯВКА" Тогда
		
		Параметры.Свойство("ВерсияБюджета", Отчет.ВерсияБюджета); 
		
		Если Не ЗначениеЗаполнено(Отчет.ВерсияБюджета) Тогда
			Отчет.ВерсияБюджета = Справочники.CW_ВерсииБюджетов.Основная;	
		Конецесли;
		
	КонецЕсли;

	Если Отчет.ВариантГруппировки = "ЗАЯВКА" 
		И Параметры.Свойство("ВариантБюджета") Тогда
		Параметры.Свойство("ВариантБюджета",  Отчет.ВариантБюджета); 
	КонецЕсли;   
	
	Элементы.ГруппаНастройки.Видимость 	= ПоказатьНастройки;
	Элементы.ФормаНастройки.Пометка 	= ПоказатьНастройки;
	             
КонецПроцедуры

&НаКлиенте
Процедура ВерсияБюджетаПриИзменении(Элемент)
	УстановитьСостояниеПоляТабличногоДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОтраженияПриИзменении(Элемент)
	УстановитьСостояниеПоляТабличногоДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеПоляТабличногоДокумента()
	
	ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
	
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = НСтр("ru = 'Отчет не сформирован. Нажмите ""Сформировать"" для получения отчета.'");;
	
КонецПроцедуры


&НаКлиенте
Процедура Настройки(Команда)
	
	ПоказатьНастройки = Не ПоказатьНастройки;
	ПоказатьСкрытьНастройки();
	
КонецПроцедуры

&наКлиенте
Процедура ПоказатьСкрытьНастройки()
	
	Элементы.ГруппаНастройки.Видимость = ПоказатьНастройки;
	Элементы.ФормаНастройки.Пометка = ПоказатьНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ЭтаФорма.СкомпоноватьРезультат();
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");	
	
	УстановитьКолонтитулы();
	
	ПоказатьНастройки = Ложь;
	ПоказатьСкрытьНастройки();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКолонтитулы()
	
	//УправлениеКолонтитулами
	УправлениеКолонтитулами.УстановитьКолонтитулы(Результат,"Анализ бюджета");
	//УправлениеКолонтитулами
	
КонецПроцедуры
